app/helpers/application_helper.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."shopify_domain" = $1 LIMIT $2  [["shopify_domain", "product-twitter.myshopify.com"], ["LIMIT", 1]]
---
	def current_shop
		shop_domain = ShopifyAPI::Shop.current.myshopify_domain
	    my_shop = Shop.where(shopify_domain: shop_domain).take