app/controllers/home_controller.rb

  def contact_us
    if request.params["authenticity_token"].present?
      puts "its a post!"
      @shop_domain = ShopifyAPI::Shop.current.myshopify_domain

      @my_shop = Shop.where(shopify_domain: @shop_domain).take
---
SELECT  "shops".* FROM "shops" WHERE "shops"."shopify_domain" = $1 LIMIT $2  [["shopify_domain", "product-twitter.myshopify.com"], ["LIMIT", 1]]