app/controllers/klaviyo_controller.rb

	def track
		@klaviyo = Klaviyo::Client.new(ENV['KLAVIYO_API_KEY'])
		@klaviyo.track('subscribe', email: params[:email])

		current_shop.update(subscribe_to_klaviyo: true)
---
UPDATE "shops" SET "subscribe_to_klaviyo" = $1, "updated_at" = $2 WHERE "shops"."id" = $3  [["subscribe_to_klaviyo", true], ["updated_at", "2020-09-16 13:27:28.948026"], ["id", 1]]