app/controllers/products_controller.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."shopify_domain" = $1 ORDER BY "shops"."id" DESC LIMIT $2  [["shopify_domain", "product-twitter.myshopify.com"], ["LIMIT", 1]]
---
	def index
		@shop_domain = ShopifyAPI::Shop.current.myshopify_domain
		@current_shop = Shop.where(shopify_domain: @shop_domain)

SELECT  "products".* FROM "products" WHERE "products"."shop_domain" = $1 ORDER BY "products"."id" ASC LIMIT $2  [["shop_domain", "product-twitter.myshopify.com"], ["LIMIT", 1]]
---
			puts "No charge"

			trial_days = 14
			if Product.where(shop_domain: @shop_domain).first.present?

UPDATE "shops" SET "premium" = $1, "updated_at" = $2 WHERE "shops"."id" = $3  [["premium", true], ["updated_at", "2020-09-17 04:10:09.983081"], ["id", 1]]
---
        	if @recurring_application_charge.price == "50.00"
        		if !@current_shop.last.premium
        			puts "Updating to Premium"
        			@current_shop.last.update(premium: true)

SELECT "products".* FROM "products" WHERE "products"."is_deleted" = $1 AND "products"."shop_domain" = $2  [["is_deleted", false], ["shop_domain", "product-twitter.myshopify.com"]]
---

	    # TODO: product fix

	    @all_products = Product.where(is_deleted: false, shop_domain: @shop_domain).index_by {|s| s.product_id}

SELECT "products".* FROM "products" WHERE "products"."product_id" = $1 AND "products"."shop_domain" = $2  [["product_id", 245], ["shop_domain", "product-twitter.myshopify.com"]]
---
	def create
		@shop_domain = ShopifyAPI::Shop.current.myshopify_domain

		images = []
		variants = []
		image = {}

		@product["images"].each do |img|
			images << {"src" => img["url"] }
		end

		# Search shop_domain

		# TODO: product fix
		check_products = Product.where(product_id: params[:id].to_i, shop_domain: @shop_domain)

SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "products" ("product_id", "store_product_id", "added_to_store_date", "created_at", "updated_at", "product_type", "shop_domain", "premium") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
				end
			end

			product = ShopifyAPI::Product.new(
				:title => @product["title"],
				:body_html =>  @product["product_description"],
				:images => images,
				:options => variant_options.present? ? variant_options.values.flatten.map { |h| h.slice(:option_type) }.each{|h| h.store(:name, h.delete(:option_type))}.uniq : [],
				:variants => variants
			)

			product.save

INSERT INTO "products" ("product_id", "store_product_id", "added_to_store_date", "created_at", "updated_at", "product_type", "shop_domain", "premium") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
			if params["collection_id"] != 'Default'
				collect = ShopifyAPI::Collect.new(product_id: product.id, collection_id: params[:collection_id])

				collect.save

SELECT  "shops".* FROM "shops" WHERE "shops"."shopify_domain" = $1 LIMIT $2  [["shopify_domain", "product-twitter.myshopify.com"], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."is_deleted" = $1 AND "products"."shop_domain" = $2  [["is_deleted", false], ["shop_domain", "product-twitter.myshopify.com"]]
---
	def my_products
		@shop_domain = ShopifyAPI::Shop.current.myshopify_domain
		puts @shop_domain

		Shop.check_shop(current_shopify_session)
	    my_shop = Shop.where(shopify_domain: @shop_domain).take

	    if my_shop.fb_uid.nil?
	      @show_facebook_login = true
	    else
	      @show_facebook_login = false
	    end

	    # TODO: add shopify_domain
		@my_products = Product.where(is_deleted: false, shop_domain: @shop_domain)
		@my_products_with_index = @my_products.index_by { |s| s.product_id }

		@my_products.each do |temp_product|

INSERT INTO "shops" ("shopify_domain", "shopify_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
			puts "DEBUGGING FOR tojea-store.myshopify.com"
			puts @shop_domain + ":::" + product.attributes["id"].to_s
			@store[product.attributes["id"]] = [] if @store[product.attributes["id"]].nil?
			@store[product.attributes["id"]] << product.attributes