app/models/shop.rb

  def self.check_shop(current_shopify_session)
  	@shop = Shop.where(shopify_domain: current_shopify_session.domain, shopify_token: current_shopify_session.token).last
  	if !@shop.present?
  		Shop.create(shopify_domain: current_shopify_session.domain, shopify_token: current_shopify_session.token)
  		@shop = Shop.where(shopify_domain: current_shopify_session.domain, shopify_token: current_shopify_session.token).last
---
SELECT  "shops".* FROM "shops" WHERE "shops"."shopify_domain" = $1 AND "shops"."shopify_token" = $2 ORDER BY "shops"."id" DESC LIMIT $3  [["shopify_domain", "product-twitter.myshopify.com"], ["shopify_token", "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"], ["LIMIT", 1]]
SELECT  1 AS one FROM "shops" WHERE LOWER("shops"."shopify_domain") = LOWER($1) LIMIT $2  [["shopify_domain", "product-twitter.myshopify.com"], ["LIMIT", 1]]
INSERT INTO "shops" ("shopify_domain", "shopify_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"